app/Controllers/Pengguna.php

    public function authenticate()
    {
        $validation = $this->validate([
            'username' => [
                'rules' => 'required|is_not_unique[pengguna.username]',
                'errors' => [
                    'required' => 'Silahkan Masukan Username Pengguna !',
                    'is_not_unique' => 'Pengguna Belum Terdaftar, Silahkan Minta Admin Untuk Proses Registrasi !'
                ]
            ],
            'password' => [
                'rules' => 'required|min_length[5]|max_length[12]',
                'errors' => [
                    'required' => 'Silahkan Masukan Password !',
                    'min_length' => 'Password Setidaknya Terdiri Dari 5 Karakter',
                    'max_length' => 'Password Tidak Lebih Dari 12 Karakter'
                ]
            ]
        ]);

        if (!$validation) {
            $validation = \Config\Services::validation();
            return $this->respond($validation->getErrors());

        } else {
            $username = $this->request->getVar('username');
            $password = $this->request->getvar('password');
            $pengguna_info = $this->pengguna->where('username', $username)->first();
---
SELECT *
FROM `pengguna`
WHERE `username` = 'rockstar14'
 LIMIT 1