app/Models/PemantauanModel.php

    public function getSensingData($namaNode)
    {
        $builder = $this->db->table('hidroponik');
        $query = $builder->select('*')
                ->join('nodeSensor', 'hidroponik.idHidroponik = nodeSensor.idHidroponik', 'left')
                ->join('sensor', 'nodeSensor.idNode = sensor.idNode', 'left')
                ->orderBy('waktu', 'desc')
                ->orderBy('sensor.idSensor','asc')
                ->where(['nodeSensor.namaNode' => $namaNode])
                ->get();
---
SELECT *
FROM `hidroponik`
LEFT JOIN `nodeSensor` ON `hidroponik`.`idHidroponik` = `nodeSensor`.`idNode`
LEFT JOIN `sensor` ON `nodeSensor`.`idNode` = `sensor`.`idNode`
WHERE `nodeSensor`.`namaNode` = 'Node Satu'
ORDER BY `waktu` DESC, `sensor`.`idSensor` ASC

    public function getHistoryData($awal, $akhir, $node)
    {
        $builder =  $this->db->table('sense');
        $query = $builder->select('sense.waktu,suhuUdara,suhuAir,pH,kelembaban,TDS,
        Status,namaNode,batasAtas,batasBawah,namaHidroponik,lokasi')
            ->join('nodeSensor', 'sense.idNode = nodeSensor.idNode')
            ->join('sensor', 'sense.idNode = sensor.idNode')
            ->join('hidroponik', 'hidroponik.idHidroponik = nodeSensor.idHidroponik', 'left')
            ->orderBy('sense.waktu', 'asc')
            ->where('DATE(sense.waktu) BETWEEN "' . date('Y-m-d', strtotime($awal)) . ' "AND" ' . date('Y-m-d', strtotime($akhir)) . '"')
            ->having(['nodeSensor.namaNode' => $node])
            ->get();
        return $query->getResult();
---
SELECT `sense`.`waktu`, HOUR(sense.waktu) as xLabel, `nodeSensor`.`status`, `batasAtas`, `batasBawah`, ROUND(AVG(pH), 2) as rata2Value
FROM `sense`
LEFT JOIN `nodeSensor` ON `sense`.`idNode` = `nodeSensor`.`idNode`
LEFT JOIN `sensor` ON `sense`.`idNode` = `sensor`.`idNode`
WHERE `sense`.`waktu` >= NOW() - INTERVAL 1 DAY AND nodeSensor.namaNode LIKE"Node Satu"
GROUP BY HOUR(sense.waktu)
ORDER BY `sense`.`waktu` DESC
SELECT *
FROM `sense`
JOIN `nodeSensor` ON `sense`.`idNode` = `nodeSensor`.`idNode`
WHERE DATE(sense.waktu) BETWEEN "2022-05-19 "AND" 2022-05-19"
HAVING `nodeSensor`.`namaNode` = 'Node Satu'
ORDER BY `waktu` ASC
SELECT `namaNode`
FROM `nodeSensor`